<template>
  <div class="f1 container-warp df fdc ac">
    <div class="news" v-for="(item,index) in newsList" :key="index">
      <p class="date"><span>{{item.date}}</span></p>
      <p class="ellipsis2 news-title">{{item.title}}</p>
    </div>
  </div>
</template>

<script>
export default {
  data(){
    return{
      newsList:[
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
        {date:'3月27日',title:'消息通知消息通知消息通知消息通知消息通知消息消息通知消息通知消息通知消息通知消息通知消息'},
      ]
    }
  }
};
</script>

<style lang="scss" scoped>

.container-warp {
  overflow-y: auto;
  background: #fff;
  margin-top: 0.13rem;
}
.news {
  @include w-h(6.9rem,1.82rem);
  border-radius: 0.1rem;
  box-shadow: 0 0 10px 2px #e0dcdc;
  margin-top: 0.3rem;
}
.date {
  margin: 0.33rem 0 0.1rem 0.29rem;

  span {
    color: #999;
    font-size: 0.26rem;
  }
}
.news-title {
  color: #666;
  font-size: $fs28;
  margin: 0 0.46rem 0 0.29rem;

}
</style>
